## Ejercicio 1

Crea una función llamada ejercicio1, que recibe la ruta donde se encuentra un dataset y devuelve una DataFrame con los datos que hay en el dataset. Para comprobar esta función utiliza el dataset `titanic.csv` que se incluye en esta actividad.

In [28]:
import pandas as pd

def ejercicio1(ruta):
    return pd.read_csv(ruta)

In [29]:
df = ejercicio1('./titanic.csv')

In [30]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Ejercicio 2

Crea otra función llamada ejercicio2. Esta función recibe un único argumento que es un dataframe. En concreto debe recibir el dataframe que se ha obtenido de leer el dataset `titanic.csv`. Esta función devolverá otro dataset que incluya únicamente a los pasajeros menores de 35 años y que viajaban en 3ª clase.

In [31]:
def ejercicio2(df):
    return df[(df['Age'] < 35) & (df['Pclass'] == 3)]

In [32]:
df_2 = ejercicio2(df)

## Ejercicio 3

Crea una función llamada ejercicio3, que recibiendo como argumento el dataframe de salida del ejercicio 2, calcule el porcentaje de pasajeros menores de 35 años de 3ª clase que sobrevivieron.

In [33]:
def ejercicio3(df):
    return df['Survived'].value_counts(normalize=True)[1]*100

In [34]:
ejercicio3(df_2)

np.float64(27.27272727272727)

## Ejercicio 4

Implementa una función llamada ejercicio4 que recibiendo el dataframe con los datos del Titanic, devuelva en una tupla el porcentaje de hombres y mujeres que viajaban en el Titanic, redondeados al segundo decimal.

In [35]:
def ejercicio4(df):
    df =  (round(df['Sex'].value_counts(normalize=True)*100, 2))
    return tuple(df)

In [36]:
ejercicio4(df)

(64.76, 35.24)

## Ejercicio 5


Implementa una función llamada ejercicio5 que recibiendo el dataframe con los datos del Titanic, devuelva en una lista el número de pasajeros que viajaban en 1ª, 2ª y 3ª clase.

In [50]:
def ejercicio5(df):
    df = df['Pclass'].value_counts().sort_index()
    # retornar una lista
    return df.tolist()

In [51]:
ejercicio5(df)

[216, 184, 491]